In [372]:
import pandas as pd
import numpy as np

In [373]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [374]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [375]:
for i in range(1,df['FlightNumber'].count()+1):
    if pd.isnull(df.loc[i,'FlightNumber']):
        df.loc[i,'FlightNumber']=df.loc[i-1,'FlightNumber']+10

In [376]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [379]:
df['FlightNumber']=df['FlightNumber'].apply(lambda x :int(x))   # changing float into int datatype

In [378]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [381]:
a=df['From_To']

In [382]:
a

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [383]:
b=[]         # spliting From_To column and appending into respective list
c=[]
for i in a:
    b.append(i.split('_')[0])
    c.append(i.split('_')[1])

In [266]:
b

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [267]:
c

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [268]:
ser=pd.Series(b)   # converting From(b) list into Series

In [384]:
ser

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
dtype: object

In [386]:
df1=pd.DataFrame(ser,columns=['From']) # converting From(b) series  to DataFrame

In [387]:
df1

       From
0    LoNDon
1    MAdrid
2    londON
3  Budapest
4  Brussels

In [388]:
ser1=pd.Series(c)  #converting To(c) list into Series

In [389]:
ser1

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
dtype: object

In [390]:
df2=pd.DataFrame(ser1,columns=['To'])    # converting To(c) series  to DataFrame

In [391]:
df2

          To
0      paris
1      miLAN
2  StockhOlm
3      PaRis
4     londOn

In [392]:
temp=pd.concat([df1,df2],axis=1)  # concatinating both From and To dataframes to form temporary

In [393]:
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [278]:
f=temp['From']

In [279]:
f

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From, dtype: object

In [280]:
t=temp['To']

In [281]:
t

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: To, dtype: object

In [394]:
fr=[]
for i in f:
    fr.append(i.title())   # converting case of words and appending into list fr

In [395]:
fr

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [396]:
to=[]     
for i in t:
    to.append(i.title())   # converting case of words and appending into list to

In [397]:
to

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [285]:
temp['To']=pd.DataFrame(to)      #overwriting existing column and appending the corrected case column

In [398]:
temp['From']=pd.DataFrame(fr)     #overwriting existing column and appending the corrected case column

In [399]:
temp

       From         To
0    London      paris
1    Madrid      miLAN
2    London  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [288]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [400]:
df.drop('From_To',axis=1,inplace=True)  # removing From_To column

In [401]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [291]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [402]:
df4=pd.concat([temp,df],axis=1)   # concatinating temp dataframe to the old dataframe to form new dataframe df4

In [403]:
df4

       From         To  FlightNumber  RecentDelays              Airline
0    London      paris         10045      [23, 47]               KLM(!)
1    Madrid      miLAN         10055            []    <Air France> (12)
2    London  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

# 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [404]:
df4

       From         To  FlightNumber  RecentDelays              Airline
0    London      paris         10045      [23, 47]               KLM(!)
1    Madrid      miLAN         10055            []    <Air France> (12)
2    London  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

In [405]:
a=df['RecentDelays'].apply(pd.Series)

In [408]:
a

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [351]:
df5=pd.DataFrame(a)

In [352]:
df5

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [365]:
df6=df5.rename(columns={0:"Delay1",1:"Delay2",2:"Delay3"})

In [422]:
df6    # splited the list into columns and renaming the columns

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [425]:
df7=pd.concat([df4,df6],axis=1)

In [427]:
df7

,From,To,FlightNumber,RecentDelays,Airline,Delay1,Delay2,Delay3
0,London,paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,miLAN,10055,[],<Air France> (12),NaN,NaN,NaN
2,London,StockhOlm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,PaRis,10075,[13],12. Air France,13.0,NaN,NaN
4,Brussels,londOn,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN